#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_project.project["jithin-terraform-allex-xxxx"]: Refreshing state... [id=projects/jithin-terraform-allex-xxxx]
google_project.project["gcp-allex-test121"]: Refreshing state... [id=projects/gcp-allex-test121]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_project.project["gcp-allex-test121"] will be destroyed
  # (because key ["gcp-allex-test121"] is not in for_each map)
  - resource "google_project" "project" {
      - auto_create_network = true -> null
      - billing_account     = "014D0D-FC86D0-4DECE5" -> null
      - folder_id           = "462162860246" -> null
      - id                  = "projects/gcp-allex-test121" -> null
      - labels              = {
          - "branded_bu" = "techforall"
          - "owner_id"   = "jtihin"
          - "team_dl"    = "publiccloud-engineering"
          - "usecase"    = "test_project_for_vpc_creation"
        } -> null
      - name                = "gcp-allex-test121" -> null
      - number              = "707372276804" -> null
      - project_id          = "gcp-allex-test121" -> null
    }

  # google_project.project["jithin-terraform-allex-test121"] will be created
  + resource "google_project" "project" {
      + auto_create_network = true
      + billing_account     = "014D0D-FC86D0-4DECE5"
      + folder_id           = "24734950673"
      + id                  = (known after apply)
      + labels              = {
          + "branded_bu" = "techforall"
          + "owner_id"   = "jtihin"
          + "team_dl"    = "publiccloud-engineering"
          + "usecase"    = "test_project_for_tfe"
        }
      + name                = "jithin-terraform-allex-test121"
      + number              = (known after apply)
      + project_id          = "jithin-terraform-allex-test121"
      + skip_delete         = (known after apply)
    }

  # google_project.project["jithin-terraform-allex-xxxx"] will be destroyed
  # (because key ["jithin-terraform-allex-xxxx"] is not in for_each map)
  - resource "google_project" "project" {
      - auto_create_network = true -> null
      - billing_account     = "014D0D-FC86D0-4DECE5" -> null
      - folder_id           = "24734950673" -> null
      - id                  = "projects/jithin-terraform-allex-xxxx" -> null
      - labels              = {
          - "branded_bu" = "techforall"
          - "owner_id"   = "jtihin"
          - "team_dl"    = "publiccloud-engineering"
          - "usecase"    = "test_project_for_tfe"
        } -> null
      - name                = "jithin-terraform-allex-xxxx" -> null
      - number              = "632677747545" -> null
      - project_id          = "jithin-terraform-allex-xxxx" -> null
    }

  # google_project_service.service["jithin-terraform-allex-test121.cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "jithin-terraform-allex-test121"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.service["jithin-terraform-allex-test121.compute.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "jithin-terraform-allex-test121"
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.service["jithin-terraform-allex-test121.logging.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "jithin-terraform-allex-test121"
      + service                    = "logging.googleapis.com"
    }

  # google_project_service.service["jithin-terraform-allex-test121.storage.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "jithin-terraform-allex-test121"
      + service                    = "storage.googleapis.com"
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + projects          = {
      + jithin-terraform-allex-test121 = {
          + auto_create_network = true
          + billing_account     = "014D0D-FC86D0-4DECE5"
          + folder_id           = "24734950673"
          + id                  = (known after apply)
          + labels              = {
              + branded_bu = "techforall"
              + owner_id   = "jtihin"
              + team_dl    = "publiccloud-engineering"
              + usecase    = "test_project_for_tfe"
            }
          + name                = "jithin-terraform-allex-test121"
          + number              = (known after apply)
          + org_id              = null
          + project_id          = "jithin-terraform-allex-test121"
          + skip_delete         = (known after apply)
          + timeouts            = null
        }
    }
  + projects_services = {
      + "jithin-terraform-allex-test121.cloudresourcemanager.googleapis.com" = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "jithin-terraform-allex-test121"
          + service                    = "cloudresourcemanager.googleapis.com"
          + timeouts                   = null
        }
      + "jithin-terraform-allex-test121.compute.googleapis.com"              = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "jithin-terraform-allex-test121"
          + service                    = "compute.googleapis.com"
          + timeouts                   = null
        }
      + "jithin-terraform-allex-test121.logging.googleapis.com"              = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "jithin-terraform-allex-test121"
          + service                    = "logging.googleapis.com"
          + timeouts                   = null
        }
      + "jithin-terraform-allex-test121.storage.googleapis.com"              = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "jithin-terraform-allex-test121"
          + service                    = "storage.googleapis.com"
          + timeouts                   = null
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jithinpnjm, Action: `pull_request`, Working Directory: ``, Workflow: `gcp_bootstrap_projects`*